jmeter/6-springboot-microservice-management.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="api-modular-testing">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="springboot-microservice-management" enabled="true">
        <stringProp name="TestPlan.comments">模擬100個使用者，在5秒內湧進網站，延遲n秒，此狀況持續3輪</stringProp>
        <intProp name="ThreadGroup.num_threads">100</intProp>
        <intProp name="ThreadGroup.ramp_time">5</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="迴圈控制器">
          <stringProp name="LoopController.loops">3</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">content-type</stringProp>
              <stringProp name="Header.value">application/json; charset=UTF-8</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
          <stringProp name="ConstantTimer.delay">5000</stringProp>
          <stringProp name="TestPlan.comments">每5秒間隔發API</stringProp>
        </ConstantTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="SC0101001-Application" enabled="true">
          <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
          <stringProp name="HTTPSampler.port">8091</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/springboot-microservice/management/Application</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;chName&quot;: &quot;皮卡邱&quot;,&#xd;
  &quot;enName&quot;: &quot;pika chu&quot;,&#xd;
  &quot;cid&quot;: &quot;${__RandomString(1,ABCDEFGHIJKLMNOPQRSTUVWXYZ,firstChar)}${__RandomString(9,0123456789,myRandomCid)}&quot;,&#xd;
  &quot;cidReissueDate&quot;: &quot;2000/01/01&quot;,&#xd;
  &quot;cidReissueLocation&quot;: &quot;北市&quot;,&#xd;
  &quot;cidReissueStatus&quot;: &quot;狀態正常&quot;,&#xd;
  &quot;birthDate&quot;: &quot;1990/05/05&quot;,&#xd;
  &quot;maritalStatus&quot;: &quot;01&quot;,&#xd;
  &quot;education&quot;: &quot;05&quot;,&#xd;
  &quot;currentResidentialAdd&quot;: &quot;台北市內湖區&quot;,&#xd;
  &quot;residentialAdd&quot;: &quot;台北市中山區&quot;,&#xd;
  &quot;cellphone&quot;: &quot;0933123456&quot;,&#xd;
  &quot;email&quot;: &quot;tuluber@gmail.com&quot;,&#xd;
  &quot;companyName&quot;: &quot;POKEMON股份有限公司&quot;,&#xd;
  &quot;companyIndustry&quot;: &quot;03&quot;,&#xd;
  &quot;occupation&quot;: &quot;襄理&quot;,&#xd;
  &quot;department&quot;: &quot;資訊部&quot;,&#xd;
  &quot;jobTitle&quot;: &quot;職員&quot;,&#xd;
  &quot;dateOfEmployment&quot;: &quot;2015/09/08&quot;,&#xd;
  &quot;companyAddress&quot;: &quot;台北市內湖區&quot;,&#xd;
  &quot;companyPhoneNum&quot;: &quot;021234567&quot;,&#xd;
  &quot;annualIncome&quot;: &quot;100&quot;,&#xd;
  &quot;eventCode&quot;: &quot;friday&quot;,&#xd;
  &quot;cardType&quot;: &quot;2&quot;,&#xd;
  &quot;remark&quot;: &quot;加急辦理&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="SC0102001-Review" enabled="true">
          <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
          <stringProp name="HTTPSampler.port">8091</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/springboot-microservice/management/Review</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">PUT</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;cid&quot;: &quot;${firstChar}${myRandomCid}&quot;,&#xd;
    &quot;cardType&quot;: &quot;2&quot;,&#xd;
    &quot;cardApprovalStatus&quot;:&quot;01&quot;,&#xd;
    &quot;applyRemark&quot;:&quot;通過&quot;&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="SC0103001-Activation" enabled="true">
          <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
          <stringProp name="HTTPSampler.port">8091</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/springboot-microservice/management/Activation</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">PUT</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;cid&quot;: &quot;${firstChar}${myRandomCid}&quot;,&#xd;
    &quot;cardType&quot;: &quot;2&quot;&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="springboot-microservice-View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="springboot-microservice-Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="springboot-microservice-Graph Result" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>